package project;

public class Lotto01 {
	public static void main(String[] args) {
		
		// 복권을 이용할 수 있는 프로그램을 만들어주세요.
		// =====로또프로그램=====
		// 1. 복권구매
		// 2. 팀 검색
		// 3. 결과 확인
		// 4. 시스템 종료
		
		// 1번 선택 시 
		// 	복권을 구매 할 팀의 번호(n)를 입력하세요 (사용자 입력)
		// 	복권을 구매하시겠습니까?
		//	1. 예
		//	2. 아니오
		// 		1번 선택 시 , 
		// 			복권을 구매할 방법을 선택하세요
		//			1. 직접입력
		// 			2. 랜덤뽑기
		//			3. 구매하지않기
		// 				1번 선택 시,
		// 					1~10의 숫자중 5가지를 사용자가 입력하고, n번 팀의 배열에 저장하고, n번 팀의 행운의 번호는 [ ]입니다. 출력 (단, 중복없이)
		// 					숫자 출력 후, 행운을 빕니다! :D
		//					초기메뉴로 복귀
		//				2번 선택 시,
		// 					1~10의 숫자중 5가지를 랜덤으로 n번 팀의 배열에 저장하고 , n번 팀의 행운의 번호는 [ ]입니다. 출력(단, 중복없이)
		// 					숫자 출력 후, 행운을 빕니다! :D
		//					초기메뉴로 복귀
		//				3번 선택 시,
		//					초기 메뉴로 복귀
		// 		2번 선택 시,
		// 			초기 메뉴로 복귀
		
		// 2번 선택시 
		// 	원하는 팀의 번호를 입력하세요 (사용자 입력)
		// 	이전으로 돌아가고싶다면 R을 입력하세요
		// 		번호 입력 했을 때,
		//			n팀의 복권 번호는 [       ]입니다.
		//			초기메뉴로 복귀
		// 		R 입력했을 때,
		//			초기메뉴로 복귀
		
		// 3번 선택시 
		// 	1~10의 숫자중 5가지를 랜덤으로 배열에 저장하고
		//	이번 주 행운의 번호는 [        ]입니다. 축하합니다.
		//	프로그램 종료
		
		// 4번 선택시
		// 	프로그램 종료
		
		}

}